{"data":{"allContentfulRolesIntro":{"edges":[{"node":{"rolesTitle":"Our Experts","rolesIntroduction":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"To create successful teams, we aim to have all the bases covered. Although every engagement is different we find that cross functional teams supported by a range of experts from our disciplines is critical to delivering great software. Our experts can cover multiple roles and follow the T-Model of specialisation. This enables them to offer deep knowledge on one or two different domains but also fluidly fill gaps in the team as and when they open or close so the flow of work and progress can be kept at a smooth and steady pace. ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}}}]},"allContentfulRole":{"edges":[{"node":{"roleTitle":"Delivery Leads","roleLink":"role-deliveryLeads","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Eingehende Erfahrung ist in jeder Rolle, die wir besetzen, entscheidend, aber besonders hier; kein Projekt ist gleich, und die Delivery Leads werden eine breite Palette von Umsetzungstechniken und -praktiken anwenden können (obwohl wir agile Methoden verwenden, schreiben wir keinen einzigen \"wahren Weg\" vor).\nDie EE Delivery Leads zeigen zwar Führungsstärke, aber sie tun dies auf eine Weise, die unseren Werten entspricht - sie gehen mit gutem Beispiel voran, \"teilen den Schmerz\" mit dem Team und nehmen sich die Zeit, Mentoren zu sein und ihre Fähigkeiten und ihr Wissen mit dem breiteren Team und den Interessengruppen zu teilen.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"date_range-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/5EJkY5xIyane64I2IjQYSG/49796f0c54ad4c1c5373b06d38475cb6/date_range-24px.svg"}}}},{"node":{"roleTitle":"DevOps & Operability Engineers","roleLink":"role-DevOps&OperabilityEngineers","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"We’ve come to see operability as a fundamental tenet of our DevOps work. The reasoning? The role is not simply about facilitating the continuous delivery of quality software; we focus on the operational requirements we deliver to ensure that software runs in production, as desired.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Our DevOps/Operability Engineers draw on all their experience of DevOps practices in what’s a very hands-on, collaborative role – actively pairing with others to share knowledge and increase the delivery team’s maturity around Operability.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"storage-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/2eUFWpz0QJzIOQMbzp4Aon/e64ba65c629ca1b18b0c9ac88d802dd7/storage-24px.svg"}}}},{"node":{"roleTitle":"QA","roleLink":"role-QA","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"At EE, testing is not carried within a vacuum; our QAs form a core part of the delivery team throughout an engagement, ensuring that relevant tests are fully considered, designed and performed at the appropriate points.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This is a role combining an engineering background with a consultative approach, helping clients and delivery teams to understand why, how and when to ensure code is as thoroughly understood as possible.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"bug_report-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/2rCVhPB1RCFRTQ1B7RPnHs/7df6ca3881f4897a78d8d46c1dbbc52e/bug_report-24px.svg"}}}},{"node":{"roleTitle":"UX","roleLink":"role-UX","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"We’re primarily interested in positive outcomes – and making sure the end user is happy is about as positive as it gets. We look for UX practitioners who are advocates of research-driven design, and for whom user data is a core part of the design toolbox, alongside deep knowledge of best practice and user behaviour.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Working closely with user researchers, and content and service designers where appropriate, the UX champions the voice of the customer throughout the design process, ensuring user needs remain at the heart of the design process.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"gesture-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/27B6mmq3LWfX3K7Y9lOKoD/f9ff4c6d1ba53e4954e0d8fd70483ffe/gesture-24px.svg"}}}},{"node":{"roleTitle":"Product Owners & Business Analysts","roleLink":"role-ProductOwners&BusinessAnalysts","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Our product owners and business analysts champion the client and the product. They understand the context and domain of an initiative and support clients and teams in focusing on the right goals, articulating objectives and formulating a strategy to achieve these. They also provide thought leadership, and do not shy away from challenging the client to do the right thing; of course they will also support the client as they transform and change where appropriate.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"We define these roles loosely, as they are fluid and vary from engagement to engagement. However, both encompass aspects of market and user research, product strategy, domain and technical analysis, scope and requirements management, and story writing.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"In our teams, product owners and business analysts are the glue between clients and delivery teams, and the various disciplines involved in a project. As such they can comfortably talk ‘business’, ‘design’ and ‘technology’. While they help clients to shape initiatives, they enable teams to deliver on a day-to-day basis to meet client’s expectations and deliver tangible user value.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"ballot-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/3ItfEdu5LQizONlq4Vmuec/15fa9815233ee8cc7bf3025605b21d9e/ballot-24px.svg"}}}},{"node":{"roleTitle":"Data Engineers & Data Scientists","roleLink":"role-DataEngineers&Scientists","roleSummary":null,"roleImage":{"file":{"fileName":"build-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/7BU0LDOs4yZp215R1nzqoZ/9266c3864b5803d91bcd9af6a6375035/build-24px.svg"}}}},{"node":{"roleTitle":"DevSecOps & Security","roleLink":"role-DevSecOps&Security","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"We consider security to be an integral part of delivery. It’s crucial that we comply with all applicable laws and regulations to protect our clients and their customers, while ensuring we continuously deliver software to production. Security is therefore an enabler, and a core aspect of our collaborative approach to secure software delivery.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Our security practitioners have a wide range of experience in the design, delivery and operation of secure infrastructure and software. We provide expert advice and assistance by working collaboratively with teams, ensuring we meet business needs with an appropriate approach to security. We also get our hands dirty – by building our own tools and products (where appropriate) to make it easier for the wider delivery community to build security in right from the start.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"lock-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/1bXVXmXwnbqqcpMcBwhZ5W/b9f086546bb3b7234bc3bb9e19b4de96/lock-24px.svg"}}}},{"node":{"roleTitle":"Data Analysts","roleLink":"role-dataAnalysts","roleSummary":null,"roleImage":{"file":{"fileName":"assessment-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/7x9fdTTj8flMKDx1hjRXZK/ec750c98ac1563e368a55094aa8c1d57/assessment-24px.svg"}}}},{"node":{"roleTitle":"Engineers & Tech leads","roleLink":"role-engineers&techLeads","roleSummary":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"As the title suggests, Tech Leads provide technical leadership within their teams and steer technical decisions on their projects. And of course, all this happens in a consultative, collaborative fashion – in keeping with our values.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"High levels of experience on commercial projects will be backed up by extensive knowledge of technical practices such as TDD, continuous integration, pair programming and the like. Our tech leads also have wide knowledge of languages, tools and frameworks – and the enduring curiosity to stay abreast of changes in the field.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"roleImage":{"file":{"fileName":"code-24px.svg","url":"//images.ctfassets.net/2mx9j3gfirje/3AIb91hzWHROmMJDK6xSNC/b00feadecc352249f6788bd812921ce6/code-24px.svg"}}}}]},"site":{"siteMetadata":{"title":"Equal Experts","description":"Making software better","languages":{"defaultLangKey":"de","langs":["de","en-US"]}}}}}